import { Link } from 'react-router-dom';

export default function PageNotFound() {
    return (
        <div className="flex lg:flex-row ph:flex-col p-6 sm:p-12 lg:p-24 justify-center">
            <div className="flex flex-col">
                <h1 className="text-2xl sm:text-3xl lg:text-4xl font-medium mb-3 sm:mb-4">
                    Упс... Вышла ошибка
                </h1>

                <div className="text-deep-dark opacity-65 text-sm sm:text-base mb-6 sm:mb-8">
                    <p className="mb-2">Похоже, вы попали на страницу, которой больше нет</p>
                    <p>или которая была перемещена. Возможно, адрес введён с ошибкой.</p>
                </div>

                <div className="mt-4 sm:mt-6 lg:mt-8">
                    <Link
                        to="/"
                        className="inline-flex items-center justify-center w-full sm:w-auto px-6 py-3 sm:py-2 rounded-lg bg-deep-dark bg-opacity-5 hover:bg-opacity-10 transition-all duration-300"
                    >
                    <span className="text-deep-dark text-opacity-75 font-medium text-sm sm:text-base">
                        &lt; Назад
                    </span>
                    </Link>
                </div>
            </div>
            <div className=" md:w-[50%] lg:w-auto"> {/* Добавлен контейнер с адаптивными размерами */}
                <svg
                    width="834"
                    height="776"
                    viewBox="0 0 834 776"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                    className="w-full h-auto"
                >
                    <path
                        d="M117.425 1.18664C116.434 -0.12814 114.368 0.250167 113.907 1.83067L15.8383 338.364C0.0034265 392.702 -3.82006 446.007 4.36781 498.276C11.7302 545.276 27.1853 588.872 50.733 629.065C51.9203 631.092 55.0606 629.671 54.4481 627.404C48.3367 604.78 44.9669 581.336 44.3387 557.074C43.57 527.386 47.6144 497.3 56.4718 466.815C69.3485 422.628 91.9428 379.16 124.255 336.412C156.307 294.008 202.468 247.606 262.737 197.207C263.555 196.523 263.7 195.313 263.058 194.462L117.425 1.18664ZM466.108 138.183C465.608 137.042 464.182 136.628 463.148 137.324C356.563 209.1 277.347 274.62 225.5 333.887C173.33 393.522 140.973 444.821 128.427 487.784C111.026 547.497 117.222 604.368 147.016 658.399C176.809 712.43 221.687 748.182 281.649 765.656C341.612 783.129 398.671 777.082 452.825 747.515C506.98 717.947 542.758 673.307 560.158 613.594C572.687 570.601 572.896 509.61 560.785 430.620C548.749 352.125 517.183 254.669 466.108 138.183ZM833.459 211.515C833.92 209.935 832.381 208.505 830.839 209.082L604.176 293.866C603.178 294.24 602.65 295.338 602.973 296.355C626.749 371.271 640.765 435.222 645.02 488.207C649.31 541.621 645.007 590.406 632.114 634.563C623.239 665.016 610.488 692.565 593.861 717.209C580.264 737.361 564.823 755.337 547.536 771.138C545.803 772.722 547.687 775.604 549.777 774.534C591.252 753.28 627.725 724.802 659.196 689.099C694.182 649.411 719.58 602.394 735.391 548.048L833.459 211.515Z"
                        fill="#292A27"
                        fillOpacity="0.05"
                    />
                </svg>
            </div>
        </div>
    );
}